---
kind: property
id: P:Autodesk.Revit.DB.Material.CutForegroundPatternColor
zh: 材质、材料
source: html/3cad9a34-eb3e-0889-4288-28c5cf2662d8.htm
---
# Autodesk.Revit.DB.Material.CutForegroundPatternColor Property

**中文**: 材质、材料

The color of the material cut foreground pattern.

## Syntax (C#)
```csharp
public Color CutForegroundPatternColor { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null